In [ ]:
#from google.colab import drive
#drive.mount("/content/drive")

Mounted at /content/drive

In [1]:
import os
import pandas as pd
import numpy as np
import matplotlib_inline
import matplotlib.pyplot as plt
#os.chdir("/content/drive/MyDrive/DataSets/DataSets")
os.chdir("C:/Users/Admin/Documents/FRANCE/IA_SCHOOL/PROJET_IA")

In [7]:
#Visualization and analysis of Cab_Data file.
cab = pd.read_csv("Cab_Data.csv")
cab.info()
cab.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  int64
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: float64(3), int64(2), object(2)
memory usage: 16.5+ MB

(359392, 7)

(359392, 7)

In [5]:
#Affichons les premières lignes du DataSet ainsi que sa taille
print(cab.head(30))

    Transaction ID  Date of Travel   Company        City  KM Travelled  \
0         10000011           42377  Pink Cab  ATLANTA GA         30.45
1         10000012           42375  Pink Cab  ATLANTA GA         28.62
2         10000013           42371  Pink Cab  ATLANTA GA          9.04
3         10000014           42376  Pink Cab  ATLANTA GA         33.17
4         10000015           42372  Pink Cab  ATLANTA GA          8.73
5         10000016           42376  Pink Cab  ATLANTA GA          6.06
6         10000017           42372  Pink Cab   AUSTIN TX         44.00
7         10000018           42376  Pink Cab   AUSTIN TX         35.65
8         10000019           42381  Pink Cab   BOSTON MA         14.40
9         10000020           42375  Pink Cab   BOSTON MA         10.89
10        10000021           42380  Pink Cab   BOSTON MA         39.60
11        10000022           42375  Pink Cab   BOSTON MA         21.80
12        10000023           42380  Pink Cab   BOSTON MA         12.00
13        10000024           42375  Pink Cab   BOSTON MA         32.67
14        10000025           42377  Pink Cab   BOSTON MA         25.52
15        10000026           42379  Pink Cab   BOSTON MA         15.54
16        10000027           42376  Pink Cab   BOSTON MA          6.65
17        10000028           42377  Pink Cab   BOSTON MA         34.22
18        10000029           42371  Pink Cab   BOSTON MA         21.34
19        10000030           42371  Pink Cab   BOSTON MA         41.30
20        10000031           42375  Pink Cab   BOSTON MA          1.96
21        10000032           42376  Pink Cab   BOSTON MA         13.44
22        10000033           42381  Pink Cab   BOSTON MA         23.40
23        10000034           42372  Pink Cab  CHICAGO IL         23.20
24        10000035           42378  Pink Cab  CHICAGO IL          4.48
25        10000036           42380  Pink Cab  CHICAGO IL         37.76
26        10000037           42380  Pink Cab  CHICAGO IL         14.56
27        10000038           42377  Pink Cab  CHICAGO IL         39.55
28        10000039           42379  Pink Cab  CHICAGO IL          6.66
29        10000040           42376  Pink Cab  CHICAGO IL         37.05

    Price Charged  Cost of Trip
0          370.95       313.635
1          358.52       334.854
2          125.20        97.632
3          377.40       351.602
4          114.62        97.776
5           72.43        63.024
6          576.15       475.200
7          466.10       377.890
8          191.61       146.880
9          156.98       113.256
10         570.83       475.200
11         317.27       220.180
12         158.01       134.400
13         470.94       392.040
14         360.79       298.584
15         234.78       169.386
16         101.39        76.475
17         498.02       407.218
18         324.21       226.204
19         646.06       454.300
20          27.71        20.776
21         193.74       145.152
22         295.15       259.740
23         396.73       278.400
24          55.27        51.520
25         541.76       407.808
26         191.33       171.808
27         540.93       454.825
28          95.55        68.598
29         447.12       381.615

In [8]:
# Visualisons le nombre de données manquantes pour chaque variable
cab.isna().sum()

Transaction ID    0
Date of Travel    0
Company           0
City              0
KM Travelled      0
Price Charged     0
Cost of Trip      0
dtype: int64

In [9]:
#On se sent effrayé par la manière dont la date a été enrégistrée. Du coup on va visualiser cette colonne
print(cab["Date of Travel"].dtypes)
# On peut remarquer que le format n'est pas celui indiqué pour indiquer la date.
# Nous allons donc le convertir

int64

In [10]:
# revisualisons le dataset
print(cab['Date of Travel'])

0         42377
1         42375
2         42371
3         42376
4         42372
          ...
359387    43108
359388    43104
359389    43105
359390    43105
359391    43102
Name: Date of Travel, Length: 359392, dtype: int64

In [ ]:
# Convertissons la date en format date.

In [11]:
from datetime import datetime, timedelta

In [12]:
def to_date_format(n):
    date_str =(datetime(1899,12,30) + timedelta(n-1)).strftime("%d-%m-%Y")
    date_date =  datetime.strptime(date_str, "%d-%m-%Y")
    return date_date

In [13]:
cab['Date of Travel']=cab['Date of Travel'].apply(lambda x:to_date_format(x))

In [ ]:
cab.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,2016-01-07,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,2016-01-05,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,2016-01-01,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,2016-01-06,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,2016-01-02,Pink Cab,ATLANTA GA,8.73,114.62,97.776

In [ ]:
# On peut classifier notre data set en fonction de la date par ordre croissant

In [14]:
cab = cab.sort_values(by = ['Date of Travel'])

cab = cab.reset_index(drop = True )

print(cab.shape)
cab.head(10)

(359392, 7)

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10001340,2016-01-01,Yellow Cab,WASHINGTON DC,10.20,202.54,135.8640
1,10000640,2016-01-01,Yellow Cab,CHICAGO IL,15.60,374.66,209.6640
2,10000635,2016-01-01,Yellow Cab,CHICAGO IL,25.08,532.83,337.0752
3,10001001,2016-01-01,Yellow Cab,NEW YORK NY,46.80,1391.91,595.2960
4,10000171,2016-01-01,Pink Cab,SAN DIEGO CA,14.28,269.15,147.0840
5,10001009,2016-01-01,Yellow Cab,PHOENIX AZ,30.00,1000.52,403.2000
6,10000605,2016-01-01,Yellow Cab,CHICAGO IL,35.52,760.86,430.5024
7,10001014,2016-01-01,Yellow Cab,SACRAMENTO CA,38.00,1065.42,547.2000
8,10000600,2016-01-01,Yellow Cab,CHICAGO IL,23.75,531.25,336.3000
9,10000182,2016-01-01,Pink Cab,SAN DIEGO CA,2.36,47.89,23.6000

In [18]:
# On peut faire une visions statistique élémentaire globale sur notre jeu de données avec la fonction roun pour plus joli
round(cab.describe(include = 'all'))

C:\Users\Admin\AppData\Local\Temp/ipykernel_6864/470114121.py:2: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  round(cab.describe(include = 'all'))

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
count,359392.0,359392,359392,359392,359392.0,359392.0,359392.0
unique,NaN,1095,2,19,NaN,NaN,NaN
top,NaN,2018-01-04 00:00:00,Yellow Cab,NEW YORK NY,NaN,NaN,NaN
freq,NaN,2022,274681,99885,NaN,NaN,NaN
first,NaN,2016-01-01 00:00:00,NaN,NaN,NaN,NaN,NaN
last,NaN,2018-12-30 00:00:00,NaN,NaN,NaN,NaN,NaN
mean,10220761.0,NaN,NaN,NaN,23.0,423.0,286.0
std,126806.0,NaN,NaN,NaN,12.0,274.0,158.0
min,10000011.0,NaN,NaN,NaN,2.0,16.0,19.0
25%,10110810.0,NaN,NaN,NaN,12.0,206.0,151.0
50%,10221036.0,NaN,NaN,NaN,22.0,386.0,282.0
75%,10330937.0,NaN,NaN,NaN,33.0,584.0,414.0
max,10440107.0,NaN,NaN,NaN,48.0,2048.0,691.0

In [24]:
print("\nFeature's datatypes\n\n{}".format(cab.dtypes))

Feature's datatypes

Transaction ID             int64
Date of Travel    datetime64[ns]
Company                   object
City                      object
KM Travelled             float64
Price Charged            float64
Cost of Trip             float64
dtype: object

In [ ]:
print('City dataset has {} entries , {} features and {} missing values'.format(City.shape[0] ,City.shape[1] ,missing_value))

In [ ]:
#Visualisation of City.csv file

In [35]:
city = pd.read_csv("City.csv")
print(city.info())
print(city.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     object
 2   Users       20 non-null     object
dtypes: object(3)
memory usage: 304.0+ bytes
None
(20, 3)

In [36]:
city.head(10)

             City   Population      Users
0     NEW YORK NY   8,405,837    302,149
1      CHICAGO IL   1,955,130    164,468
2  LOS ANGELES CA   1,595,037    144,132
3        MIAMI FL   1,339,155     17,675
4  SILICON VALLEY   1,177,609     27,247
5   ORANGE COUNTY   1,030,185     12,994
6    SAN DIEGO CA     959,307     69,995
7      PHOENIX AZ     943,999      6,133
8       DALLAS TX     942,908     22,157
9      ATLANTA GA     814,885     24,701

In [ ]:
# On remarque la présence des virgules entre les valeurs des variables Population et Users.
# Pour cela nous allons les transormer en float afin de ne pas avoir d'ennuie lors de l'élaboration des calculs statistiques

In [37]:
city['Population'] = [x.replace(',','') for x in city['Population']]
city['Users'] = [x.replace(',','') for x in city['Users']]
city['Population'] = city['Population'].astype(float)
city['Users'] = city['Users'].astype(float)

In [38]:
# On peut maintenant vérifier si le type a effectivement changer
city.dtypes

City           object
Population    float64
Users         float64
dtype: object

In [39]:
city.head(10)

             City  Population     Users
0     NEW YORK NY   8405837.0  302149.0
1      CHICAGO IL   1955130.0  164468.0
2  LOS ANGELES CA   1595037.0  144132.0
3        MIAMI FL   1339155.0   17675.0
4  SILICON VALLEY   1177609.0   27247.0
5   ORANGE COUNTY   1030185.0   12994.0
6    SAN DIEGO CA    959307.0   69995.0
7      PHOENIX AZ    943999.0    6133.0
8       DALLAS TX    942908.0   22157.0
9      ATLANTA GA    814885.0   24701.0

In [ ]:
#Visualisation and analysis of Customer_ID.csv

In [40]:
customer = pd.read_csv("Customer_ID.csv")
print(customer.head(15))

    Customer ID Gender  Age  Income (USD/Month)
0         29290   Male   28               10813
1         27703   Male   27                9237
2         28712   Male   53               11242
3         28020   Male   23               23327
4         27182   Male   33                8536
5         27318   Male   25               13984
6         33788   Male   23               23788
7         34106   Male   19               19980
8         59799   Male   33               19271
9         57982   Male   57                5068
10        58774   Male   20               23602
11        58627   Male   28               27338
12        59007   Male   63                6683
13        58215   Male   25                6862
14        59372   Male   53                4912

In [ ]:
# Visualisation and analysis of Transaction_ID.csv file

In [23]:
transaction = pd.read_csv("Transaction_ID.csv")
print(transaction.head(15))
print(transaction.shape)

    Transaction ID  Customer ID Payment_Mode
0         10000011        29290         Card
1         10000012        27703         Card
2         10000013        28712         Cash
3         10000014        28020         Cash
4         10000015        27182         Card
5         10000016        27318         Cash
6         10000017        33788         Card
7         10000018        34106         Card
8         10000019        59799         Cash
9         10000020        57982         Cash
10        10000021        58774         Cash
11        10000022        58627         Card
12        10000023        59007         Card
13        10000024        58215         Cash
14        10000025        59372         Cash
(440098, 3)

#